# University Analysis

In [33]:
import numpy as np
import pandas as pd

In [34]:
uni = pd.read_csv('University_info.csv')
crime = pd.read_csv('Crime.csv')
startup_rank = pd.read_csv('metro_startup_ranking.csv')

C:\Users\ADMIN\AppData\Roaming\Python\Python38\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (7,9,1427,1542,1561,1575,1725,1726,1727,1728) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [35]:
uni.head(6)

,UNITID,OPEID,opeid6,INSTNM,CITY,STABBR,ZIP,AccredAgency,INSTURL,NPCURL,...,PELL_RPY_3YR_RT_SUPP,NOPELL_RPY_3YR_RT_SUPP,FEMALE_RPY_3YR_RT_SUPP,MALE_RPY_3YR_RT_SUPP,FIRSTGEN_RPY_3YR_RT_SUPP,NOTFIRSTGEN_RPY_3YR_RT_SUPP,C150_L4_POOLED_SUPP,C150_4_POOLED_SUPP,C200_L4_POOLED_SUPP,C200_4_POOLED_SUPP
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,galileo.aamu.edu/netpricecalculator/npcalc.htm,...,0.443586698337,0.45251396648,0.484818805093,0.406,0.423580786026,0.442452830189,NaN,0.30871831265508,NaN,0.35168556430446
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,www.collegeportraits.org/AL/UAB/estimator/agree,...,0.732297852901,0.795454545455,0.760521885522,0.755344418052,0.751552795031,0.765074770863,NaN,0.50854980789381,NaN,0.4730923834537
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,tcc.noellevitz.com/(S(miwoihs5stz5cpyifh4nczu0...,...,0.600877192982,0.775,0.610465116279,0.686567164179,0.632653061224,0.65,NaN,PrivacySuppressed,NaN,PrivacySuppressed
3,100706,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,finaid.uah.edu/,...,0.738341968912,0.85140562249,0.768378650554,0.798440979955,0.778156996587,0.791666666667,NaN,0.47821134615384,NaN,0.49412939796716
4,100724,100500,1005,Alabama State University,Montgomery,AL,36104-0271,Southern Association of Colleges and Schools C...,www.alasu.edu/email/index.aspx,www.alasu.edu/cost-aid/forms/calculator/index....,...,0.320016820858,0.380829015544,0.364423717522,0.286530612245,0.315737051793,0.334633385335,NaN,0.25748195545488,NaN,0.29365162671232
5,100751,105100,1051,The University of Alabama,Tuscaloosa,AL,35487-0166,Southern Association of Colleges and Schools C...,www.ua.edu/,oira.ua.edu,...,0.763829082478,0.876039304611,0.816259087905,0.816176470588,0.786885245902,0.838674335798,NaN,0.66600935383909,NaN,0.69062709956709

In [36]:
crime.head(6)

,MSA,ViolentCrime,Murder,Rape,Robbery,AggravatedAssault,PropertyCrime,Burglary,Theft,MotorVehicleTheft,State,City
0,"Abilene, TX M.S.A.",412.5,5.3,56.0,78.4,272.8,"3,609.0",852.0,"2,493.6",263.4,TX,Abilene
1,"Akron, OH M.S.A.",238.4,5.1,38.2,75.2,119.8,"2,552.4",575.3,"1,853.0",124.1,OH,Akron
2,"Albany, GA M.S.A.",667.9,7.8,30.4,157.9,471.8,"3,894.1","1,099.6","2,652.8",141.7,GA,Albany
3,"Albany, OR M.S.A.",114.3,2.5,28.2,20.7,63.0,"3,208.4",484.6,"2,476.1",247.7,OR,Albany
4,"Albuquerque, NM M.S.A.",792.6,6.1,63.8,206.7,516.0,"4,607.8",883.4,"3,047.6",676.9,NM,Albuquerque
5,"Alexandria, LA M.S.A.",936.4,4.5,35.5,120.1,776.3,"4,565.9","1,167.0","3,083.7",315.2,LA,Alexandria

In [37]:
startup_rank.head(6)

,Metro Area Code,Metro Area Name,Metro Area Main City,Metro Area States,Startup Rank
0,12060,Atlanta-Sandy Springs-Marietta,Atlanta,Georgia,13
1,12420,Austin-Round Rock-San Marcos,Austin,Texas,1
2,12580,Baltimore-Towson,Baltimore,Maryland,17
3,14460,Boston-Cambridge-Quincy,Boston,Massachusetts-New Hampshire,22
4,16740,Charlotte-Gastonia-Rock Hill,Charlotte,North Carolina-South Carolina,25
5,16980,Chicago-Joliet-Naperville,Chicago,Illinois-Indiana-Wisconsin,21

# Criteria:

1. University at urban/metropolitan area-\> In University data, LOCALE column should be value 11, 12 or 13
2. City rank \>= 75th percentile-\> In Metro Startup Ranking data, calculate 75th percentile then filter the data
3. Total crimes number \<= 50th percentile-\> In Crime data, calculate total crimes number then filter the data
4. University has “Computer And Information Sciences And Support Services” Program-\> In University data, these following columns should have value different from 0

- CIP11CERT1
- CIP11CERT2
- CIP11ASSOC
- CIP11CERT4
- CIP11BACHL_(These clues can be found in file Dictionary for University\_info.csv)_

### Step1 : Adjust columns in crime and startup\_rank data

In [38]:
crime.dtypes
# Columns ViolentCrime, PropertyCrime, Burglary, Theft are not in number format -> need to change

MSA                   object
ViolentCrime          object
Murder               float64
Rape                 float64
Robbery              float64
AggravatedAssault    float64
PropertyCrime         object
Burglary              object
Theft                 object
MotorVehicleTheft    float64
State                 object
City                  object
dtype: object

In [39]:
# Need to remove "," from the number
crime['ViolentCrime'] = crime['ViolentCrime'].str.replace(',','').astype(float)
crime['PropertyCrime'] = crime['PropertyCrime'].str.replace(',','').astype(float)
crime['Burglary'] = crime['Burglary'].str.replace(',','').astype(float)
crime['Theft'] = crime['Theft'].str.replace(',','').astype(float)

In [40]:
crime.describe(include = 'all')

,MSA,ViolentCrime,Murder,Rape,Robbery,AggravatedAssault,PropertyCrime,Burglary,Theft,MotorVehicleTheft,State,City
count,378,377.000000,378.000000,378.000000,378.000000,377.000000,372.000000,374.000000,375.000000,378.000000,378,373
unique,378,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,58,341
top,"Abilene, TX M.S.A.",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,CA,Springfield
freq,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,31,4
mean,NaN,364.988064,4.574868,41.306614,77.702646,241.319098,2621.934409,537.622193,1900.392800,191.081746,NaN,NaN
std,NaN,181.214645,3.383652,19.506386,53.977181,137.267225,820.691755,229.176000,576.696896,134.532918,NaN,NaN
min,NaN,61.600000,0.000000,2.700000,2.300000,25.500000,420.000000,159.700000,226.500000,15.700000,NaN,NaN
25%,NaN,236.300000,2.200000,29.000000,36.625000,144.200000,2022.100000,362.725000,1493.900000,97.550000,NaN,NaN
50%,NaN,333.700000,3.800000,37.550000,67.350000,215.700000,2585.250000,503.350000,1854.000000,154.450000,NaN,NaN
75%,NaN,447.700000,6.275000,51.550000,106.050000,304.900000,3207.950000,671.050000,2264.050000,249.650000,NaN,NaN
max,NaN,1160.000000,20.600000,165.600000,351.900000,981.300000,5190.600000,1503.700000,3936.400000,718.600000,NaN,NaN

In [41]:
crime.isna().sum()

MSA                  0
ViolentCrime         1
Murder               0
Rape                 0
Robbery              0
AggravatedAssault    1
PropertyCrime        6
Burglary             4
Theft                3
MotorVehicleTheft    0
State                0
City                 5
dtype: int64

In [42]:
# Number of NaN values are small enough -> Chamge to 0
crime.loc[:,['ViolentCrime', 'AggravatedAssault', 'PropertyCrime', 'Burglary', 'Theft']] = \
    crime.loc[:,['ViolentCrime', 'AggravatedAssault', 'PropertyCrime', 'Burglary', 'Theft']].fillna(0)

In [43]:
crime.isna().sum()

MSA                  0
ViolentCrime         0
Murder               0
Rape                 0
Robbery              0
AggravatedAssault    0
PropertyCrime        0
Burglary             0
Theft                0
MotorVehicleTheft    0
State                0
City                 5
dtype: int64

In [44]:
# Because City Name in startup_rank data has no blank -> need to remove blank from City column in crime data
crime['City'] = crime['City'].str.replace(' ','')

In [45]:
# Calculate Total number of Crimes
crime['No_of_crime'] = \
    crime['ViolentCrime'] + crime['Murder'] + crime['Rape'] + \
        crime['Robbery'] + crime['AggravatedAssault'] + crime['PropertyCrime'] + \
            crime['Burglary'] + crime['Theft'] + crime['MotorVehicleTheft']

In [46]:
# Rename column for later joining tables
startup_rank.rename(columns = {'Metro Area Main City' : 'City', 'Metro Area States' : 'State', 'Startup Rank' : 'Startup_rank'}, inplace = True)

In [47]:
# Turn UPPERCASE state columns in startup_rank data for later joining tables
startup_rank['State'] = startup_rank['State'].str.upper()

In [48]:
# Split column state into rows because one State could have many Cities
startup_rank = startup_rank.set_index(['Metro Area Code', 'Metro Area Name', 'City', 'Startup_rank']).apply(lambda x: x.str.split('-').explode()).reset_index()

In [49]:
# US State Code
# ref: https://www.ssa.gov/international/coc-docs/states.html
us_state_code = pd.read_csv('us_state_codes.csv')

In [50]:
# Add state_code column into startup_rank data
startup_rank = startup_rank.merge(us_state_code, left_on='State', right_on='state_name', how='left')

### Step 2: Create a table from joining startup_rank and crime data to filter cities qualified criteria 2 and 3</span>

In [51]:
# Create join keys
startup_rank['join_key'] = startup_rank['City'] + startup_rank['state_code']
crime['join_key'] = crime['City'] + crime['State']

In [52]:
# Joining 2 tables
city_criteria = startup_rank[["City", "State", "state_code", "Startup_rank", "join_key"]].merge(crime[['join_key', 'No_of_crime', 'ViolentCrime', 'Murder', 'Rape', 'Robbery', 'AggravatedAssault', 'PropertyCrime', 'Burglary', 'Theft', 'MotorVehicleTheft']], left_on='join_key', right_on='join_key', how='left')

In [53]:
# Adjust the duplicate values
city_criteria2 = city_criteria.groupby(['City', 'state_code', 'State', 'Startup_rank']).agg({'ViolentCrime': ['mean'], 'Murder': ['mean'], 'Rape': ['mean'], 'Robbery': ['mean'], 'AggravatedAssault': ['mean'], 'PropertyCrime': ['mean'], 'Burglary': ['mean'], 'Theft': ['mean'], 'MotorVehicleTheft': ['mean'], 'No_of_crime': ['mean'] }).reset_index()

In [54]:
# Rename
city_criteria2.columns = ['City', 'state_code', 'State', 'Startup_rank', 'ViolentCrime', 'Murder', 'Rape', 'Robbery', 'AggravatedAssault', 'PropertyCrime', 'Burglary', 'Theft', 'MotorVehicleTheft', 'No_of_crime']

In [55]:
# Create qualified column for criteria  startup_rank >= 75% quartile(less is better) and no_of_crime < 50% quartile (less is better)
city_criteria2['flag_startup_condition'] = np.where(city_criteria2['Startup_rank'] < city_criteria2['Startup_rank'].quantile(0.25), 'yes', 'no')
city_criteria2['flag_crime_condition'] = np.where(city_criteria2['No_of_crime'] < city_criteria2['No_of_crime'].quantile(0.5), 'yes', 'no')

### Step 3: Filter with criteria 1 and 4

In [56]:
uni2 = uni[(uni['LOCALE'].isin([11,12,13])) & \
    ( (uni['CIP11CERT1'] != 0)\
    | (uni['CIP11CERT2'] != 0)\
    | (uni['CIP11ASSOC'] != 0)\
    | (uni['CIP11CERT4'] != 0)\
    | (uni['CIP11BACHL'] != 0))]\
    .merge(city_criteria2, left_on=['CITY', 'STABBR'], right_on=['City', 'state_code'], how='left')

In [57]:
uni_shortlist = uni2[(uni2['flag_startup_condition'] == 'yes') & (uni2['flag_crime_condition'] == 'yes')]\
    [['UNITID', 'INSTNM', 'CITY', 'State', 'Startup_rank', 'No_of_crime']].reset_index(drop=True)

In [58]:
uni_shortlist

,UNITID,INSTNM,CITY,State,Startup_rank,No_of_crime
0,126562,University of Colorado Denver,Denver,COLORADO,5.0,1112.8
1,126702,The Art Institute of Colorado,Denver,COLORADO,5.0,1112.8
2,126872,College America-Denver,Denver,COLORADO,5.0,1112.8
3,126942,Community College of Denver,Denver,COLORADO,5.0,1112.8
4,127060,University of Denver,Denver,COLORADO,5.0,1112.8
5,127158,Emily Griffith Technical College,Denver,COLORADO,5.0,1112.8
6,127565,Metropolitan State University of Denver,Denver,COLORADO,5.0,1112.8
7,127699,National American University-Denver,Denver,COLORADO,5.0,1112.8
8,127918,Regis University,Denver,COLORADO,5.0,1112.8
9,222938,The Art Institute of Houston,Houston,TEXAS,8.0,2097.2
10,222992,Austin Community College District,Austin,TEXAS,1.0,5920.9
11,224004,Concordia University-Texas,Austin,TEXAS,1.0,5920.9
12,225423,Houston Community College,Houston,TEXAS,8.0,2097.2
13,225432,University of Houston-Downtown,Houston,TEXAS,8.0,2097.2
14,225511,University of Houston,Houston,TEXAS,8.0,2097.2
15,225575,Huston-Tillotson University,Austin,TEXAS,1.0,5920.9
16,225858,ITT Technical Institute-Houston West,Houston,TEXAS,8.0,2097.2
17,227757,Rice University,Houston,TEXAS,8.0,2097.2
18,227845,Saint Edward's University,Austin,TEXAS,1.0,5920.9
19,228778,The University of Texas at Austin,Austin,TEXAS,1.0,5920.9
20,229063,Texas Southern University,Houston,TEXAS,8.0,2097.2
21,366678,ITT Technical Institute-Austin,Austin,TEXAS,1.0,5920.9
22,367361,Interactive Learning Systems-Houston,Houston,TEXAS,8.0,2097.2
23,381787,Westwood College-Denver South,Denver,COLORADO,5.0,1112.8
24,438656,Everest Institute-Greenspoint,Houston,TEXAS,8.0,2097.2
25,441016,Everest Institute-Hobby,Houston,TEXAS,8.0,2097.2
26,442727,Everest Institute-Austin,Austin,TEXAS,1.0,5920.9
27,443696,Interactive Learning Systems-North Houston,Houston,TEXAS,8.0,2097.2
28,445133,American InterContinental University-Houston,Houston,TEXAS,8.0,2097.2
29,451820,The Art Institute of Austin,Austin,TEXAS,1.0,5920.9
30,451875,National American University-Austin,Austin,TEXAS,1.0,5920.9
31,458973,Strayer University-Texas,Austin,TEXAS,1.0,5920.9
32,480888,CyberTex Institute of Technology,Austin,TEXAS,1.0,5920.9
33,482307,National American University-Austin South,Austin,TEXAS,1.0,5920.9

### **Extra:** Create method to rank universities

In [81]:
uni2['Total Degree'] = ( uni2['CIP11CERT1'] + uni2['CIP11CERT2'] + uni2['CIP11ASSOC'] + uni2['CIP11CERT4'] + uni2['CIP11BACHL'] )

In [109]:
uni_shortlist2 = uni2[(uni2['flag_startup_condition'] == 'yes') & (uni2['flag_crime_condition'] == 'yes')]\
    [['UNITID', 'INSTNM', 'CITY', 'State', 'LOCALE', 'Startup_rank', 'No_of_crime', 'Total Degree']].reset_index(drop=True)

In [110]:
uni_shortlist2.head()

,UNITID,INSTNM,CITY,State,LOCALE,Startup_rank,No_of_crime,Total Degree
0,126562,University of Colorado Denver,Denver,COLORADO,11.0,5.0,1112.8,2.0
1,126702,The Art Institute of Colorado,Denver,COLORADO,11.0,5.0,1112.8,3.0
2,126872,College America-Denver,Denver,COLORADO,11.0,5.0,1112.8,2.0
3,126942,Community College of Denver,Denver,COLORADO,11.0,5.0,1112.8,4.0
4,127060,University of Denver,Denver,COLORADO,11.0,5.0,1112.8,3.0

**Methodology:**

Allocate **Weight** to 4 criteria as following:

1\. Crimes (less = better) \* 4  
2\. Startup Rank (1st = best) \* 3  
3\. Locale (specified: 11 = 3, 12 = 2, 13 = 1) \* 2  
4\. Total Degree (greater = variety) \* 1

Each criterion is scored by ranking formulas or allocate to it.

In [152]:
# Create score tables
# Crime criteria
crime_crt = pd.DataFrame({'CITY' : uni_shortlist2['CITY'].unique(), 'No_of_crime' : uni_shortlist2['No_of_crime'].unique()})

# Startup Rank criteria
startup_crt = pd.DataFrame({'CITY' : uni_shortlist2['CITY'].unique(), 'Startup_rank' : uni_shortlist2['Startup_rank'].unique()})

score1 = crime_crt.merge(startup_crt, on = 'CITY', how='left')
score1['Crime Score'] = (score1['No_of_crime'].count() + 1 - score1['No_of_crime'].rank(pct = True)*score1['No_of_crime'].count())
score1['Startup Score'] = (score1['Startup_rank'].count() + 1 - score1['Startup_rank'].rank(pct = True)*score1['Startup_rank'].count())
score1

      CITY  No_of_crime  Startup_rank  Crime Score  Startup Score
0   Denver       1112.8           5.0          3.0            2.0
1  Houston       2097.2           8.0          2.0            1.0
2   Austin       5920.9           1.0          1.0            3.0

In [153]:
# Locale score
uni_shortlist2['LOCALE'].unique()
score2 = pd.DataFrame({'LOCALE' : uni_shortlist2['LOCALE'].unique(), 'Locale Score' : [2,1]})
score2

   LOCALE  Locale Score
0    11.0             2
1    12.0             1

In [154]:
# Degree score
uni_shortlist2['Total Degree'].unique()
degree_range = uni_shortlist2['Total Degree'].unique().tolist()
print(degree_range)
score3 = pd.DataFrame({'Total Degree' : range(1,9), 'Degree Score' : range(1,9)})
score3

[2.0, 3.0, 4.0, 6.0, 5.0, 1.0, 8.0]

   Total Degree  Degree Score
0             1             1
1             2             2
2             3             3
3             4             4
4             5             5
5             6             6
6             7             7
7             8             8

In [177]:
# Join score tables then Calculate total score
uni_shortlist3 = uni_shortlist2.merge(score1, on = 'CITY', how = 'left') \
    .merge(score2, on = 'LOCALE', how = 'left') \
        .merge(score3, on = 'Total Degree', how = 'left')
uni_shortlist3['Total_score'] = uni_shortlist3['Crime Score'] * 4 \
                                + uni_shortlist3['Startup Score'] * 3 \
                                + uni_shortlist3['Locale Score']  * 2 \
                                + uni_shortlist3['Degree Score']  * 1 
# Sort by Score
uni_shortlist3[['INSTNM', 'Total_score']].sort_values(by = 'Total_score' , ascending = False)

                                          INSTNM  Total_score
7            National American University-Denver         28.0
3                    Community College of Denver         26.0
8                               Regis University         26.0
1                  The Art Institute of Colorado         25.0
4                           University of Denver         25.0
31                      Strayer University-Texas         25.0
0                  University of Colorado Denver         24.0
2                         College America-Denver         24.0
5               Emily Griffith Technical College         24.0
6        Metropolitan State University of Denver         24.0
23                 Westwood College-Denver South         24.0
30           National American University-Austin         23.0
33     National American University-Austin South         23.0
10             Austin Community College District         22.0
12                     Houston Community College         21.0
11                    Concordia University-Texas         20.0
19             The University of Texas at Austin         19.0
21                ITT Technical Institute-Austin         19.0
26                      Everest Institute-Austin         18.0
15                   Huston-Tillotson University         18.0
32              CyberTex Institute of Technology         18.0
18                     Saint Edward's University         18.0
9                   The Art Institute of Houston         18.0
29                   The Art Institute of Austin         18.0
28  American InterContinental University-Houston         17.0
27    Interactive Learning Systems-North Houston         17.0
13                University of Houston-Downtown         17.0
22          Interactive Learning Systems-Houston         17.0
16          ITT Technical Institute-Houston West         17.0
25                       Everest Institute-Hobby         16.0
24                 Everest Institute-Greenspoint         16.0
14                         University of Houston         16.0
20                     Texas Southern University         16.0
17                               Rice University         16.0